Revit 2024 API
MetallicpaintFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintFinish" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MetallicpaintFinishType
Visual Basic
Public Enumeration MetallicpaintFinishType
Visual C++
public enum class MetallicpaintFinishType
Members
Member name | Description
Smooth
Peeling
See Also
Autodesk.Revit.DB.Visual Namespace